{"pageProps":{"code":"var Component=(()=>{var d=Object.create;var s=Object.defineProperty;var u=Object.getOwnPropertyDescriptor;var c=Object.getOwnPropertyNames;var p=Object.getPrototypeOf,y=Object.prototype.hasOwnProperty;var m=(n,o)=>()=>(o||n((o={exports:{}}).exports,o),o.exports),f=(n,o)=>{for(var a in o)s(n,a,{get:o[a],enumerable:!0})},r=(n,o,a,t)=>{if(o&&typeof o==\"object\"||typeof o==\"function\")for(let i of c(o))!y.call(n,i)&&i!==a&&s(n,i,{get:()=>o[i],enumerable:!(t=u(o,i))||t.enumerable});return n};var g=(n,o,a)=>(a=n!=null?d(p(n)):{},r(o||!n||!n.__esModule?s(a,\"default\",{value:n,enumerable:!0}):a,n)),b=n=>r(s({},\"__esModule\",{value:!0}),n);var h=m((A,l)=>{l.exports=_jsx_runtime});var C={};f(C,{default:()=>I,frontmatter:()=>w});var e=g(h()),w={title:\"What is a Lead?\",abstract:\"Published on January 28, 2020\",date:\"2022-04-21\",banner:\"/static/hello-world-banner.jpg\"};function v(n={}){let{wrapper:o}=n.components||{};return o?(0,e.jsx)(o,Object.assign({},n,{children:(0,e.jsx)(a,{})})):a();function a(){let t=Object.assign({p:\"p\"},n.components);return(0,e.jsxs)(e.Fragment,{children:[(0,e.jsx)(t.p,{children:`A sales lead is a person or business who may eventually become a client. Because this purchase depends on the salesperson's solution, you could ask 100 salespeople \"what qualifies as a lead\" and the question will get 100 different answers. Before I answer this seemingly complex question of \"what is a lead\", it's important to qualify \"what leads to a sale\".`}),(0,e.jsx)(t.p,{children:\"Here are a few proven sales qualification techniques used by hundreds of millions of salespeople:\"}),(0,e.jsx)(t.p,{children:\"B.A.N.T. = Budget | Authority | Need | Time\"}),(0,e.jsx)(t.p,{children:\"If you want to play ball, let's check a few boxes first. A.N.U.M. = Authority | Need | Urgency | Money\"}),(0,e.jsx)(t.p,{children:\"Are you buying what I'm selling? C.A.M.P. = Challenges | Authority | Money | Priority\"}),(0,e.jsx)(t.p,{children:\"Got a problem that needs solving? I can help. F.A.I.N.T. = Funds | Authority | Interest | Need | Timing\"}),(0,e.jsx)(t.p,{children:\"You've got money, let's be friends M.E.D.D.I.C. = Metrics | Economic Buyer | Decision Criteria | Decision Process | Identify Pain | Champion\"}),(0,e.jsx)(t.p,{children:\"Spread the word, we're about to make/save you some money! Depending on what it is you sell, how long it takes to sell it, how much it costs to buy it, and the political landscape involved in each sale, all or none of the above well-respected qualification criteria are useful.\"}),(0,e.jsx)(t.p,{children:\"The problem I've found with all of these is that they all require a prospect to have a predefined budget, challenge, and ambition to solve the said challenge. If that's the case then why have most of the sales I've made in my career ($10's of Millions in ACV) come from seemingly content prospects whom I have had to educate before they are motivated enough to source a budget for their (unknown) challenges?\"}),(0,e.jsx)(t.p,{children:\"When you are speaking with a CXO, teaching them about team-wide efficiencies, untapped cross-department collaborations, or the analytical potential through consolidating systems and building real-time dashboards, their eyes should widen and their body language should be inquisitive. If you have educated a CXO and they realise the positive impact in transitioning to this new state, they will find the Budget | Authority | Need | Urgency | Challenges | Priority | Interest | Timing | Metrics | Economic Buyer | Decision Criteria | Decision Process | Identify Pain | Champion and political hurdles needed to jump in order to get that pen to paper and sign a contract.\"}),(0,e.jsx)(t.p,{children:\"FUN FACT: IBM invented BANT over 60 years ago and MEDDIC was invented over 30 years ago.\"}),(0,e.jsx)(t.p,{children:\"SIDE NOTE: If the way people buy has flipped on its head in the past couple of decades, why are so many salespeople still dependent on outdated sales techniques?\"}),(0,e.jsx)(t.p,{children:\"I'm a big believer in the Challenger Sales methodology = Teach, Tailor, and Take Control... But TTTC doesn't have a nice ring to it...\"}),(0,e.jsx)(t.p,{children:\"E.A.T. = Educate | Adjust | Transition\"}),(0,e.jsx)(t.p,{children:\"When you open this box, your life will never be the same. But, with great wisdom comes great responsibility. Only if you educate them on something truly useful and customise this to their business landscape will they transition to a new solution.\"}),(0,e.jsx)(t.p,{children:\"Now, to answer the first question: What is a lead?\"}),(0,e.jsx)(t.p,{children:\"If you have a CXO/Decision-maker that has learned a bit about your business and now wants to invest their time in a salesperson to better understand your solutions, that's a lead. If you know your stuff, then you should be able to qualify that lead and eventually convert it into a sale.\"}),(0,e.jsx)(t.p,{children:\"It is your job as the salesperson to educate prospects, not just on your products but on the impact of your solutions to their business.\"})]})}}var I=v;return b(C);})();\n;return Component;","frontmatter":{"title":"What is a Lead?","abstract":"Published on January 28, 2020","date":"2022-04-21","banner":"/static/hello-world-banner.jpg"},"timecode":"00:03:00:30","ogImage":"https://manymangoes.com/og/bb61e412fae8be12865688e54dcfcd3a.png"},"__N_SSG":true}